In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost/mydb

In [5]:
%%sql
DROP TABLE IF EXISTS regex_samples;
Create table regex_samples(
    id INT auto_increment primary key,
    sample_text Varchar(50)
);

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.

[]

In [6]:
%%sql
INSERT INTO regex_samples (sample_text) VALUES
('apple'),
('Banana'),
('cherry'),
('date'),
('elderberry'),
('fig'),
('grape'),
('honeydew'),
('running'),
('123abc');

 * mysql+mysqlconnector://root:***@localhost/mydb
10 rows affected.

[]

In [7]:
%%sql
select * from regex_samples

 * mysql+mysqlconnector://root:***@localhost/mydb
10 rows affected.

[(1, 'apple'),
 (2, 'Banana'),
 (3, 'cherry'),
 (4, 'date'),
 (5, 'elderberry'),
 (6, 'fig'),
 (7, 'grape'),
 (8, 'honeydew'),
 (9, 'running'),
 (10, '123abc')]

In [8]:
%%sql
#Example 1: Match Strings That Start with “a”

SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^a';

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[(1, 'apple')]

In [10]:
%%sql
#Example 2: Match Strings That End with “e”
SELECT * 
FROM regex_samples
WHERE sample_text REGEXP 'e$';

 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[(1, 'apple'), (4, 'date'), (7, 'grape')]

In [13]:
%%sql
#Example 3: Match Strings That Start with a Digit

SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^[0-9]';

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[(10, '123abc')]

In [15]:
%%sql
#Example 4: Match Strings Ending with “ing”
SELECT * 
FROM regex_samples
WHERE sample_text REGEXP 'ing$';

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[(9, 'running')]

In [16]:
%%sql
#Example 5: Match Strings with Consecutive Repeated Characters
SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '(.)\\1';

 * mysql+mysqlconnector://root:***@localhost/mydb
4 rows affected.

[(1, 'apple'), (3, 'cherry'), (5, 'elderberry'), (9, 'running')]

In [17]:
%%sql
#Example 6: Match Strings That Contain Only Letters

SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^[A-Za-z]+$';

 * mysql+mysqlconnector://root:***@localhost/mydb
9 rows affected.

[(1, 'apple'),
 (2, 'Banana'),
 (3, 'cherry'),
 (4, 'date'),
 (5, 'elderberry'),
 (6, 'fig'),
 (7, 'grape'),
 (8, 'honeydew'),
 (9, 'running')]

In [19]:
%%sql
#Example 7: Match Strings with Exactly 5 Characters
#This will not work here, if you do the same code in command line or workbench it will work perfectly
SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^.{5}$';

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [20]:
%%sql
#Example 8: Match Strings Containing an Uppercase Letter (Case‑Sensitive) -- this may not work in some versions
SELECT * 
FROM regex_samples
WHERE sample_text REGEXP BINARY '[A-Z]';

 * mysql+mysqlconnector://root:***@localhost/mydb
(mysql.connector.errors.DatabaseError) 3995 (HY000): Character set 'utf8mb4_0900_ai_ci' cannot be used in conjunction with 'binary' in call to regexp_like.
[SQL: #Example 8: Match Strings Containing an Uppercase Letter (Case‑Sensitive) -- this may not work in some versions
SELECT *
FROM regex_samples
WHERE sample_text REGEXP BINARY '[A-Z]';]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

In [23]:
%%sql
#Example 9: Match Only “apple” or “banana” or "grape" Exactly
SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^(apple|banana|grape)$';

 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[(1, 'apple'), (2, 'Banana'), (7, 'grape')]

In [24]:
%%sql
#Example 10: Match Strings Starting with 3 Digits Followed by Letters

SELECT * 
FROM regex_samples
WHERE sample_text REGEXP '^[0-9]{3}[A-Za-z]+$';

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [25]:
%%sql
drop table if exists demo_data;
CREATE TABLE demo_data (
    id INT AUTO_INCREMENT PRIMARY KEY,
    full_name VARCHAR(50),
    phone VARCHAR(25),
    email VARCHAR(100),
    date_col VARCHAR(10),   -- Storing as VARCHAR for the demo
    status VARCHAR(20),
    sku VARCHAR(20),
    username VARCHAR(30),
    notes VARCHAR(100)
);

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.

[]

In [26]:
%%sql
INSERT INTO demo_data (full_name, phone, email, date_col, status, sku, username, notes)
VALUES
-- 1
('John Smith', 
 '123-456-7890', 
 'john@example.com', 
 '2025-02-07', 
 'pending', 
 'ABCD', 
 'johnsmith', 
 'Ships to CA'),

-- 2
('Alice Johnson', 
 '(987) 654-3210', 
 'alice@@example.net', 
 '2025-02-07', 
 'inactive', 
 'SKU-123', 
 'alice', 
 'NY location'),

-- 3
('Bob Williams', 
 '+1-555-123-4567', 
 'bob@sample.org', 
 '20250207', 
 'complete', 
 '1SKU', 
 'bob123', 
 'Shipping to CA'),

-- 4
('Mary 1 White', 
 '(123) 123-4567', 
 'mary123@example.com', 
 '2025-13-31', 
 'PENDING', 
 'abc-999', 
 'mary_white', 
 'Something about CA or'),

-- 5
('Mark-Spencer', 
 '1234567890', 
 'mark@example.com', 
 '2024-11-02', 
 'active', 
 'SKU-9999', 
 'mark', 
 'Random note'),

-- 6
('Jane O''Connor',   -- Note the doubled apostrophe for SQL
 '987-654-3210', 
 'jane.o.connor@example.org', 
 '2024-12-31', 
 'inactive', 
 'ABCDE', 
 'janeO', 
 'Contains CA or NY'),

-- 7
('Invalid Mail', 
 '000-000-0000', 
 'invalid@@example..com', 
 '2023-01-15', 
 'inactive', 
 'XYZ000', 
 'invalid', 
 'Double @ and dots'),

-- 8
('NoSpacesHere', 
 '+12-345-678-9012',
 'nospaces@example.co',
 '2025-02-07',
 'pending',
 'SKU999',
 'NoSpaces',
 'Ends with .co domain');

 * mysql+mysqlconnector://root:***@localhost/mydb
8 rows affected.

[]

In [27]:
%%sql
select * from demo_data

 * mysql+mysqlconnector://root:***@localhost/mydb
8 rows affected.

[(1, 'John Smith', '123-456-7890', 'john@example.com', '2025-02-07', 'pending', 'ABCD', 'johnsmith', 'Ships to CA'),
 (2, 'Alice Johnson', '(987) 654-3210', 'alice@@example.net', '2025-02-07', 'inactive', 'SKU-123', 'alice', 'NY location'),
 (3, 'Bob Williams', '+1-555-123-4567', 'bob@sample.org', '20250207', 'complete', '1SKU', 'bob123', 'Shipping to CA'),
 (4, 'Mary 1 White', '(123) 123-4567', 'mary123@example.com', '2025-13-31', 'PENDING', 'abc-999', 'mary_white', 'Something about CA or'),
 (5, 'Mark-Spencer', '1234567890', 'mark@example.com', '2024-11-02', 'active', 'SKU-9999', 'mark', 'Random note'),
 (6, "Jane O'Connor", '987-654-3210', 'jane.o.connor@example.org', '2024-12-31', 'inactive', 'ABCDE', 'janeO', 'Contains CA or NY'),
 (7, 'Invalid Mail', '000-000-0000', 'invalid@@example..com', '2023-01-15', 'inactive', 'XYZ000', 'invalid', 'Double @ and dots'),
 (8, 'NoSpacesHere', '+12-345-678-9012', 'nospaces@example.co', '2025-02-07', 'pending', 'SKU999', 'NoSpaces', 'Ends with .co domain')]

In [29]:
%%sql
# 1. Matching a Strict Date Format (YYYY-MM-DD)
# This will work in command line or workbench, this is issue with the notebooks
SELECT *
FROM demo_data
WHERE date_col REGEXP '^[0-9]{4}-[0-9]{2}-[0-9]{2}$';

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [30]:
%%sql
#2. Matching Names Containing Only Letters and Spaces
SELECT *
FROM demo_data
WHERE full_name REGEXP '^[A-Za-z ]+$';

 * mysql+mysqlconnector://root:***@localhost/mydb
5 rows affected.

[(1, 'John Smith', '123-456-7890', 'john@example.com', '2025-02-07', 'pending', 'ABCD', 'johnsmith', 'Ships to CA'),
 (2, 'Alice Johnson', '(987) 654-3210', 'alice@@example.net', '2025-02-07', 'inactive', 'SKU-123', 'alice', 'NY location'),
 (3, 'Bob Williams', '+1-555-123-4567', 'bob@sample.org', '20250207', 'complete', '1SKU', 'bob123', 'Shipping to CA'),
 (7, 'Invalid Mail', '000-000-0000', 'invalid@@example..com', '2023-01-15', 'inactive', 'XYZ000', 'invalid', 'Double @ and dots'),
 (8, 'NoSpacesHere', '+12-345-678-9012', 'nospaces@example.co', '2025-02-07', 'pending', 'SKU999', 'NoSpaces', 'Ends with .co domain')]